; A056465: Number of primitive (aperiodic) palindromes using exactly four different symbols.
; Submitted by Science United
; 0,0,0,0,0,0,24,24,240,240,1560,1560,8400,8376,40824,40800,186480,186240,818520,818280,3497976,3496440,14676024,14674440,60780720,60772320,249401640,249393480,1016542800,1016501736,4123173624,4123132800,16664093400,16663908480,67171367616,67171179600,270232006800,270231188280,1085570773224,1085569963080,4356217681200,4356214174824,17466686971800,17466683473800,69992221752936,69992207117976,280345359228024,280345344511200,1122510953731416,1122510892950480,4493432566523880,4493432505929640

#offset 1

sub $0,1
mov $3,$0
bin $3,2
add $3,$0
add $3,$0
mov $2,$0
lpb $2
  sub $2,1
  mov $0,$3
  sub $0,$2
  mov $4,$0
  add $4,1
  mov $10,$4
  mul $4,8
  nrt $4,2
  add $4,1
  div $4,2
  mov $9,$4
  bin $4,2
  sub $10,$4
  mov $12,$9
  div $12,$10
  mov $11,$9
  mod $11,$10
  equ $11,0
  seq $12,8683 ; Möbius (or Moebius) function mu(n). mu(1) = 1; mu(n) = (-1)^k if n is the product of k different primes; otherwise mu(n) = 0.
  mul $12,$11
  mov $4,$12
  mov $8,$0
  mul $8,8
  add $8,1
  nrt $8,2
  add $8,1
  div $8,2
  bin $8,2
  sub $0,$8
  div $0,2
  mov $6,4
  pow $6,$0
  mov $5,2
  pow $5,$0
  mov $7,3
  pow $7,$0
  sub $7,$5
  mov $0,$7
  mul $0,3
  sub $6,1
  sub $6,$0
  mov $0,$6
  mul $0,4
  mul $0,$12
  add $1,$0
lpe
mov $0,$1
