; A032170: "CHK" (necklace, identity, unlabeled) transform of 1, 2, 3, 4, ...
; Submitted by [AF>Libristes] ElGuillermo
; 1,2,5,10,24,50,120,270,640,1500,3600,8610,20880,50700,124024,304290,750120,1854400,4600200,11440548,28527320,71289000,178526880,447910470,1125750120,2833885800,7144449920,18036373140,45591631800,115381697740,292329067800,741410800830,1882219707600,4782781997700,12163730046576,30960472798080,78864881379120,201037491880500,512827531417680,1309034904224796,3343510133363400,8545008319192700,21850863594179880,55906160274430200,143111689475075072,366526239595462800,939161596810893120

#offset 1

mov $2,$0
sub $0,1
mov $3,$0
bin $3,2
add $3,$0
add $3,$2
lpb $2
  sub $2,1
  mov $0,$3
  sub $0,$2
  mov $4,$0
  mul $4,8
  nrt $4,2
  add $4,1
  div $4,2
  mov $7,$4
  bin $4,2
  mov $8,$0
  sub $8,$4
  mov $10,$7
  div $10,$8
  sub $0,1
  mov $9,$7
  mod $9,$8
  equ $9,0
  seq $10,8683 ; Möbius (or Moebius) function mu(n). mu(1) = 1; mu(n) = (-1)^k if n is the product of k different primes; otherwise mu(n) = 0.
  mul $10,$9
  mov $4,$10
  mov $5,0
  mov $6,$0
  mul $6,8
  add $6,1
  nrt $6,2
  add $6,1
  div $6,2
  bin $6,2
  sub $0,$6
  add $0,1
  seq $0,32198 ; "CIK" (necklace, indistinct, unlabeled) transform of 1,2,3,4,...
  mul $0,$10
  add $1,$0
lpe
mov $0,$1
