; A060220: Number of orbits of length n under the full 17-shift (whose periodic points are counted by A001026).
; Submitted by Science United
; 17,136,1632,20808,283968,4022064,58619808,871959240,13176430176,201599248032,3115626937056,48551851084080,761890617915840,12026987582075856,190828203433892736,3041324491793194440,48661191875666868480,781282469552728498992,12582759772902701307744,203211570332277826420896,3290092091095653927165888,53389221660050644867170672,868155169602587991415611552,14143694638108805083928800560,230825096493936095157582742848,3773102538843185789899794497760,61767086006247714352348782945888

#offset 1

sub $0,1
mov $1,1
add $1,$0
gcd $2,$1
pow $2,2
mov $4,$0
add $4,1
mov $5,$0
bin $5,2
add $5,$0
add $5,$4
lpb $4
  sub $4,1
  mov $0,$5
  sub $0,$4
  mov $6,$0
  mul $6,8
  nrt $6,2
  add $6,1
  div $6,2
  mov $9,$6
  bin $6,2
  mov $10,$0
  sub $10,$6
  mov $12,$9
  div $12,$10
  mov $11,$9
  mod $11,$10
  equ $11,0
  seq $12,8683 ; Möbius (or Moebius) function mu(n). mu(1) = 1; mu(n) = (-1)^k if n is the product of k different primes; otherwise mu(n) = 0.
  mul $12,$11
  mov $6,$12
  mov $8,$0
  mul $8,8
  nrt $8,2
  add $8,1
  div $8,2
  bin $8,2
  sub $0,$8
  mov $7,17
  pow $7,$0
  mul $7,396
  mov $0,$7
  mul $0,$12
  add $3,$0
lpe
mul $2,4
mul $1,$3
div $1,$2
mov $0,$1
div $0,99
